{
  "users": [
    {
      "email": "mai1120@gmail.com",
      "password": "$2a$10$OstgLj7kbWfmMXdQV6Uiz.vhgJvyb14XVlHXeMAFMqwAStUoUlaES",
      "fullname": "mai thanh duong",
      "id": 1,
      "status": true,
      "permission": 0
    },
    {
      "email": "mai11202@gmail.com",
      "password": "$2a$10$kCuzVyxVNN2fjUWNyl8IFOPIiHM9IKJpssFDyoAxsCEw7KR.hMKKO",
      "fullname": "mai thanh duong",
      "id": 2,
      "status": false,
      "permission": 0
    },
    {
      "email": "mai112023@gmail.com",
      "password": "$2a$10$KRDULzS1EAk7dntn7E3pRO5Cal3DQERc03ZWjhDINGZZ/bHEho2cu",
      "fullname": "mai thanh duong",
      "id": 3,
      "status": true,
      "permission": 0
    },
    {
      "email": "mai1120235@gmail.com",
      "password": "$2a$10$smzcwxLYyLwMOmvP7Pi4B.WkLetbB84E689BtKRyfRFrJz4JhJP2S",
      "fullname": "mai thanh duong",
      "id": 4,
      "status": false,
      "permission": 0
    },
    {
      "email": "mai11202357@gmail.com",
      "password": "$2a$10$7d5GxVW3S0ZdJhFyafePmOsfiFG2/nEpLdMkxc81Re5oU.Pc6gbIa",
      "fullname": "mai thanh duong",
      "id": 5,
      "status": false,
      "permission": 0
    },
    {
      "email": "nguyenmai@gmail.com",
      "password": "$2a$10$shCR4mqnmwe8G.Q15Wsy6uthpAyJq/nA/spI16QtIRduoFB9CCMm.",
      "fullName": "Nguyễn Mai",
      "id": 6,
      "status": true,
      "permission": 0
    },
    {
      "email": "nam@gmail.com",
      "password": "123456",
      "fullname": "Nguyễn Mai",
      "id": 7,
      "status": true,
      "permission": 1
    },
    {
      "email": "nmai@gmail.com",
      "password": "01689983378",
      "fullname": "Nguyễn Mai",
      "id": 7,
      "status": true,
      "permission": 1
    },
    {
      "email": "nam1@gmail.com",
      "password": "1234567",
      "fullname": "Quang Nam",
      "status": true,
      "permission": 0,
      "id": 8
    },
    {
      "email": "minh123@gmail.com",
      "password": "123456",
      "fullname": "Thanh Minh",
      "status": true,
      "permission": 0,
      "id": 9
    },
    {
      "email": "nam22@gmail.com",
      "password": "123456",
      "fullname": "Nguyễn Mai",
      "status": false,
      "permission": 0,
      "id": 10
    },
    {
      "email": "nmai22@gmail.com",
      "password": "1234567",
      "fullname": "Nguyễn Mai",
      "status": true,
      "permission": 0,
      "id": 11
    }
  ],
  "products": [
    {
      "postTitle": "Bản Cát Cát",
      "postContents": "BẢN CÁT CÁT được biết đến là một ngôi làng mang vẻ đẹp của vùng núi Tây Bắc. Ngôi làng này thuộc xã San Sả Hồ, huyện Sapa. Nếu bạn khởi hành từ trung tâm thị trấn Sapa đến cổng của bản chỉ mất khoảng hơn 2km. Ngoài việc di chuyển bằng các phương tiện cá nhân, du khách đến đây cũng có thể đi bộ để ngắm núi rừng, chiêm ngưỡng được toàn bộ vẻ đẹp của bản làng từ trên cao. Sau khi đi một quãng đường dài quanh ngôi làng thì đoạn đường trở về có thể sẽ khiến bạn khá mệt. Do đó, nếu những bạn có sức khỏe không tốt thì nên đi xe máy và gửi xe ở cổng của bản. Bản Cát Cát có nền văn hóa độc đáo với lối kiến trúc đặc trưng truyền thống. Khung cảnh nên thơ cũng là một điểm thu hút các bạn trẻ đến đây. Ngay khi đặt chân tại cổng chính của ngôi làng cổ, bạn đã nhận thấy được sự yên bình của khung cảnh nơi đây. Một số địa điểm hay những hoạt động du khách có thể khám phá tại đây như: Đi trên con đường đá, Chèo thuyền trên suối, Check-in tại các địa điểm hấp dẫn,... Giá vé: Vé vào bản Cát Cát với giá 50.000đ/người. Giá vé gửi xe máy là 10.000đ/chiếc. Giá thuê quần áo dân tộc là 50.000đ/người.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e4a0509c87.jpg",
      "createDate": "2023-02-07",
      "status": "true",
      "id": 1
    },
    {
      "postTitle": "Bản Tả Phìn",
      "postContents": "BẢN TẢ PHÌN là một trong những địa điểm nên đi ở Sapa, cách trung tâm thị trấn khoảng 12km đi về hướng Tây Bắc. Bản hấp dẫn du khách bởi cảnh quan thiên nhiên tươi mới pha lẫn nét hoang sơ, mộc mạc cùng với nền văn hóa đậm bản sắc dân tộc. Đến nơi đây, bạn sẽ được khám phá và tìm hiểu đời sống sinh hoạt cũng như các phong tục tập quán của đồng bào dân tộc. Các nghi lễ nổi tiếng tạo nên bản sắc của vùng đất này như: múa Bai Tram bắt ba ba, nghi lễ cưới, hát giao duyên,... Bên cạnh đó, Bản Tả Phìn còn nổi tiếng bởi các món đồ thổ cẩm được thiết kế vô cùng tinh xảo. Đây cũng là một sự lựa chọn rất thích hợp để du khách có thể làm quà mang về cho bạn bè và người thân đấy nhé! Giá vé: 40.000 đ/ vé người lớn, 20.000 đ/ vé trẻ em.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e4b1f4d60f.jpg",
      "createDate": "2023-02-07",
      "status": "true",
      "id": 2
    },
    {
      "postTitle": "Cổng trời Sapa",
      "postContents": " CỔNG TRỜI SAPA Một trong địa điểm du lịch Sapa tiếp theo đó chính là Cổng trời. Cổng trời Sapa là địa điểm du lịch rất nổi tiếng tọa lạc trên đỉnh đèo Ô Quy Hồ có độ cao 2035m so với mực nước biển. Cổng trời cách thị trấn Sapa 18km. Du khách muốn đến được đây phải vượt qua đèo Ô Quy Hồ với quãng đường lên tới 50 km. Nếu như không muốn di chuyển bằng xe máy vì đường đi khó khăn, các bạn có đi bằng xe ôm, xe taxi đến trạm Tôn. Sau đó bạn cần phải mua vé cáp treo để lên được cổng trời. Hình thức này tuy tốn chi phí khá nhiều so với đi bằng xe máy nhưng lại đảm bảo an toàn tuyệt đối cho các bạn trong quá trình di chuyển đấy! Hành trình để đến được Cổng trời Sapa tuy khó khăn. Nhưng khi đặt chân đến đây, bạn sẽ nhận thấy điều đó thực sự xứng đáng. Đặc biệt là khung cảnh núi non bao quanh, nổi bật bởi rừng cây xanh lá. Ngắm nhìn cảnh đẹp bao la, hùng vĩ này cũng đủ khiến bạn có cảm giác sảng khoái và như được hòa mình vào thiên nhiên vậy. Giá vé: Người lớn giá vé 100.000 đ/ người. Trẻ em giá vé 60.000đ ( 1m đến 1m4) Trẻ em dưới 1m được miễn phí",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e49aeeeba6.jpg",
      "createDate": "2023-01-31",
      "status": "true",
      "id": 3
    },
    {
      "postTitle": "Bản Ý Linh Hồ, Sapa",
      "postContents": "BẢN Ý LINH HỒ, từ thị trấn Sapa, du khách đi theo hướng bản Lao Chải. Sau khi đi qua bản Lao Chải chừng 3km dưới chân dốc. Du khách sẽ thấy được hình bóng bản Ý Linh Hồ hoang sơ và đầy thơ mộng trên sườn núi. Bản Ý Linh Hồ hấp dẫn du khách bởi nét đẹp hoang sơ và nên thơ của mình. Xung quanh bản được bao quanh bởi dãy núi Hoàng Liên Sơn. Cùng với đó là các khe suối, ruộng bậc thang, nương rẫy... Bên trong bản là những ngôi nhà được làm từ tre, nứa thô sơ và mang nét bình dị, gần gũi của người dân nơi đây.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e4b84c9c64.jpg",
      "createDate": "2023-02-15",
      "status": "true",
      "id": 4
    },
    {
      "postTitle": "Bản Lao Chải - Tả Van",
      "postContents": " MUỐN ĐẾN TẢ VAN- LAO CHẢI, Từ thị trấn Sapa, du khách muốn đi đến bản Lao Chải – Tả Van có thể di chuyển theo hướng phố Cầu Mây và Mường Hoa. Sau đó tiếp tục đi theo đường mòn ở đồi Ý Linh Hồ để qua Lao Chải. Nếu lựa chọn đi bộ sẽ phải mất hơn ba tiếng đồng hồ để di chuyển từ thị trấn về nơi này. Bạn cũng có thể sử dụng xe máy và ô tô nếu đi cùng gia đình hay người thân. Đến với Bản Lao Chải - Tả Van, du khách sẽ bị thu hút bởi không gian yên tĩnh đến lạ thường. Nổi bật nhất vẫn là các thửa ruộng bậc thang canh tác lúa, hoa màu rộng lớn và trải khắp các sườn đồi. Đặc biệt, nếu đi vào đúng mùa gặt, tức khoảng tháng 4 hoặc tháng 9 trong năm. Du khách sẽ có cơ hội được chiêm ngưỡng một phong cảnh hùng vĩ của núi rừng cùng với những cánh đồng lúa chín trên các thửa ruộng bậc thang. Tất cả tạo nên một bức tranh đầy màu sắc của tự nhiên. Giá vé: 75.000đ/người lớn, 50.000đ/ trẻ em (trẻ dưới 1m được miễn phí).",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e49aeeec69.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 5
    },
    {
      "postTitle": "Đèo Ô Quy Hồ Sapa - Vua đèo Tây Bắc",
      "postContents": " ĐÈO Ô QUY HỒ, Không phải ngẫu nhiên mà Đèo Ô Quy Hồ được mệnh danh là Vua đèo Tây Bắc. Đèo được biết đến là con đèo lớn và đẹp nhất ở Sapa. Đây cũng là con đèo dài nhất của vùng núi Tây Bắc. Do đó, nếu đi đèo bằng xe máy, các bạn cần phải hết sức cẩn thận. Đường đi tuy ngoằn ngoèo và hiểm trở nhưng Đèo Ô Quy Hồ lại trở thành địa điểm check in lý tưởng cho mọi du khách đi đến với Sapa. Với độ cao lên đến 2000m so với mực nước biển. Đứng trên đèo Ô Quy Hồ nhìn xuống, bạn gần như nhìn thấy toàn bộ được khung cảnh dưới chân đèo. Từ đây, du khách có thể nhìn thấy được dãy Hoàng Liên Sơn hay đỉnh Fansipan chìm trong màn sương huyền ảo và đầy vẻ nên thơ.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e4d05564fa.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 6
    },
    {
      "postTitle": "Dinh Hoàng A Tưởng - Một trong những địa điểm nên đi ở Sapa",
      "postContents": " DINH HOÀNG A TƯỞNG , Công trình này từng được mệnh danh là ngôi nhà quyền lực nhất của vùng Bắc Hà trong những năm Pháp thuộc. Công trình được xây dựng theo lối kết hợp của kiến trúc Á - Âu. Do kiến trúc sư người Pháp và Trung Quốc thiết kế, thi công. Để có thể đến được những căn phòng phía trong dinh thự, bạn phải đi theo lối cầu thang từ hai bên, tiếp đó là phòng chờ. Bạn sẽ thấy một khoảng sân khá rộng rãi - nơi để làm những thủ tục, lễ lạc hay tổ chức vui chơi, múa hát mỗi khi có hội họp. Dinh Hoàng A Tưởng ngày nay được dùng như một địa điểm để phục vụ du lịch trong khuôn khổ nhà nước. Du khách đến đây chủ yếu để tham quan, tìm hiểu và khám phá nét đặc sắc của một công trình cổ kính. Ngoài ra, với một bên các phòng còn bày bán những món đồ thủ công của người dân bản địa như áo, váy thổ cẩm, vòng cổ, tẩu thuốc,... Giá vé: 20.000 đ một lượt. Trẻ em 6-16 tuổi giá vé 10.000 đ. Trẻ em dưới 6 tuổi, người khuyết tật được miễn phí vé. Người thuộc diện hưởng chính sách được giảm giá vé 50%",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e5e0c4bbde.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 7
    },
    {
      "postTitle": "Hà Khẩu Sapa",
      "postContents": "HÀ KHẨU  được ngăn cách với thành phố Lào Cai bởi một dòng sông nhỏ. Hà Khẩu thuộc phía Nam của tỉnh Vân Nam, Trung Quốc. Tuy không thể so sánh với các tỉnh lớn khác ở Trung Quốc nhưng Hà Khẩu vẫn mang trong mình sự nhộn nhịp của một vùng sát biên giới. Nơi đây có những trung tâm thương mại và các cửa hàng mua sắm lớn nhỏ. Nếu như bạn không phải là dân bản địa ở Lào Cai thì có thể thuê xe máy. Từ thị trấn Sapa đến cửa khẩu dài tầm 35km nên bạn sẽ mất mất khoảng 1 tiếng. Đi Quốc Lộ 4 rồi đến Cốc Lếu, đi đường Hoàng Liên, đường thoải và hơi nhiều khúc cua. Do đó, bạn nên cẩn thận ở những đoạn đường này. Đến với Hà Khẩu, ngoài những địa điểm về shopping, ăn uống thì công viên Ánh Sáng cũng là nơi mà bạn nên ghé qua. Đây là địa điểm hot nhất Hà Khẩu được các bạn trẻ Việt Nam check in khá nhiều. Do đó, nếu bạn đã đến thị trấn này rồi thì đừng bỏ qua địa điểm ấn tượng này nhé!",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e49a147382.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 8
    },
    {
      "postTitle": "Nhà thờ cổ Sapa - Nét đẹp kỳ bí của phố Núi",
      "postContents": "NHÀ THỜ CỔ SAPA - một trong những địa điểm nên đi khi du lịch Sapa dành cho cho các bạn trẻ. Nhà thờ cổ Sapa nằm trên một vị trí khá ấn tượng: phía sau là núi Hàm Rồng, phía trước là khu đất rộng - nơi có thể xây dựng nhiều công trình văn hóa để phục vụ cho các hoạt động xã hội. Đây được xem là một biểu tượng của thành phố sương mờ mà ai cũng đều muốn được đặt chân đến một lần trong đời. Mang đậm dấu ấn của kiến trúc của người Pháp, nhà thờ có những tòa biệt thự tuy khá cũ nhưng mang vẻ đẹp riêng. Nếu bạn đến Sapa thì đừng quên ghé qua nhà thờ đầy cổ kính này nhé!",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e499597ca0.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 9
    },
    {
      "postTitle": "Núi Hàm Rồng",
      "postContents": "NÚI HÀM RỒNG g nằm ngay sát thị trấn Sapa, khoảng 3km về phía thị trấn. Do đó, bạn có thể dễ dàng di chuyển đến núi. Sau khi đến nơi, du khách phải mua vé để vào cổng. Du khách phải vượt qua những bậc thang bằng đá để tham quan núi Hàm Rồng. Với những khung cảnh bao quanh như Vườn Lan, Vườn Đào, Trạm Viễn Thông Sapa, Sân Mây và Cổng Trời. Nơi đây cũng có trồng rất nhiều loại hoa, với đầy màu sắc, làm không gian núi trở nên sống động hơn. Đứng từ Trạm Viễn Thông, du khách sẽ được chiêm ngưỡng vẻ đẹp hùng vĩ của đỉnh núi Fansipan. Một địa điểm tiếp theo du khách có thể tham quan đó chính là Sân Mây. Từ Sân Mây nhìn xuống, du khách có thể nhìn thấy được toàn cảnh thị trấn Sapa, thấy thung lũng Mường Hoa và cả những khung cảnh nên thơ khác. Giá vé: 70.000 đ/ người lớn và 20.000 đ/ trẻ em (cao dưới 1.2m)",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e499597bde.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 10
    },
    {
      "postTitle": "Fansipan Legend - Top điểm đến khi du lịch Sapa",
      "postContents": "FANSIPAN LEGEND nằm tại phía Tây Nam, thuộc thị trấn Sapa. Đây được xem là quần thể khu du lịch nghỉ dưỡng với rất nhiều dịch vụ đa dạng bao gồm cáp treo, các khu vui chơi giải trí, các resort 5 sao mang đẳng cấp quốc tế. Bên cạnh đó, đỉnh Fansipan còn là một điểm đến khá mới mẻ được nhiều bạn trẻ trong và ngoài nước khám phá. Đặc biệt, khi đến với Sun World Fansipan Legend, du khách sẽ được ngắm toàn bộ cảnh núi rừng Sa Pa. Ngoài ra, nơi đây còn tập hợp những dịch vụ du lịch – nghỉ dưỡng tại thung lũng Mường Hoa với khách sạn từ 4 đến 5 sao, khu vui chơi giải trí mang đậm bản sắc văn hóa của người dân nơi đây cùng với các khu ẩm thực, các trung tâm mua sắm lớn,...chắc hẳn sẽ khiến bạn đi một lần nhớ mãi trong cuộc hành trình của mình đấy! Giá vé: Giá vé cáp treo Sunworld Fansipan dành cho người lớn từ 749.000đ, cho trẻ em từ 549.000đ vào những dịp cao điểm. Giá vé có thể thay đổi theo thời gian.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e51098fe6a.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 11
    },
    {
      "postTitle": "Cầu Mây Tả Van",
      "postContents": "CẦU MÂY TẢ VAN là một địa điểm thuộc bản Tả Van. Cầu cách Thị trấn Sapa tầm 17km đi về phía Đông Nam. Nếu xuất phát từ đường cái, du khách có thể đi theo con đường mòn chỉ khoảng 3 km là đến nơi. Cầu Mây Tả Van bắt qua dòng sông Mường Hoa đầy thơ mộng và trữ tình. Cầu gây ấn tượng du khách bởi được nó được kết bằng dây mây. Nếu bạn lựa chọn đi vào khoảng sáng sớm, sương mù giăng phủ kín cây cầu, sẽ có cảm giác như mình đang đi trong mây vậy. Đây cũng chính là điểm hấp dẫn du khách muốn đến Cầu Mây để lưu giữ cho mình những khoảnh khắc tuyệt vời này. Đặt tour Sapa trọn gói của BestPrice để thăm quan Cầu Mây dễ dàng nhất.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e499597b1a.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 12
    },
    {
      "postTitle": "Thung lũng Mường Hoa - Vẻ đẹp kỳ diệu của đất trời Sapa",
      "postContents": "THUNG LŨNG MƯỜNG HOA - một trong những địa điểm nên đi ở Sapa. Thung lũng thuộc xã Hầu Thào. Cách thị trấn Sapa khoảng 10km đi theo hướng Đông Nam. Đây là nơi sinh sống của các đồng bào người dân tộc H’Mông đen, Dao đỏ, người Giáy… Đến với thung lũng Mường Hoa Sapa, du khách sẽ được khám phá quần thể bãi đá cổ độ dài khoảng 4km với chiều rộng chừng 2km. Nơi đây còn để lại ấn tượng cho bạn bè bốn phương bởi những phiến đá cổ nằm xen giữa cây cỏ. Với các thửa ruộng bậc thang xếp tầng theo một lối rất riêng của vùng Mường Hoa. Trên đó có khắc nhiều hình vẽ, các ký hiệu kỳ lạ như hình người, chữ viết, hình mặt trời, bậc thang, con đường… Giá vé: 80.000 đ/người.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e52b0b2823.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 13
    },
    {
      "postTitle": "THÁC BẠC - Một trong những nơi nên đi ở Sapa",
      "postContents": "Thác Bạc cách trung tâm thị trấn Sapa chừng 12km đi về hướng Lai Châu – Điện Biên. Do đó, du khách có thể lựa chọn đến đây với nhiều phương tiện khác nhau như xe máy, ô tô,... Hành trình để đến được Thác Bạc không phải là điều dễ dàng. Đó là bạn phải đi qua những con đường mòn, hai bên đường là rừng thông với nhiều cây cỏ mọc xung quanh. Tuy nhiên, khi đến đây bạn sẽ cảm nhận được sự sảng khoái, thư giãn mà thành phố tập nấp khó có thể có được. Giá vé: 20.000 đ/người lớn và 10.000 đ/trẻ em.",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e539da7177.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 14
    },
    {
      "postTitle": "THUNG LŨNG HOA HỒNG- Thiên đường lãng mạn ở Sapa",
      "postContents": "Thung lũng Hoa Hồng tọa lạc tại một khu xóm nhỏ trên đường Mường Hoa, thuộc thị trấn Sapa. Với lối thiết kế tự nhiên cùng đường nét hài hòa, nơi đây mang đến cho du khách cảm giác bình yên và tuyệt vời chưa từng có. Chỉ cần nghe tên cũng đủ thấy được Thung lũng Hoa Hồng là một địa điểm lãng mạn và vô cùng lý tưởng cho các bạn trẻ có tâm hồn “mơ mộng”. Đặc biệt điểm đến cũng là lựa chọn rất hợp lý cho những cặp đôi đang yêu nhau. Giá vé: 70.000đ/ người. ",
      "image": "https://owa.bestprice.vn/images/articles/uploads/top-15-dia-diem-nen-di-o-sapa-duoc-yeu-thich-nhat-5f1e49aeeec69.jpg",
      "createDate": "25/2/2023",
      "status": "true",
      "id": 15
    }
  ],
  "catalogs": [
    {
      "name": "danh lam thắng cảnh",
      "status": "true",
      "id": 4
    },
    {
      "name": "khách sạn",
      "status": "false",
      "id": 5
    },
    {
      "name": "nhà hàng",
      "status": "true",
      "id": 6
    },
    {
      "name": "trải nghiệm",
      "status": "true",
      "id": 8
    },
    {
      "name": "thị trấn sapa",
      "status": "true",
      "id": 9
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}